//Задача 1: Даны два числа. Показать большее и меньшее число.
int a=2;
bool f=false;
Console.WriteLine(a*Convert.ToInt16(f));